abc122_a.lisp
##########################################
##########################################
##########################################
##########################################
##########################################
##########################################
##########################################
(defun complement-base (base)
  (cond
    ((string= base "A") "T")
    ((string= base "T") "A")
    ((string= base "C") "G")
    ((string= base "G") "C")
    (t "Unknown")))

(princ (complement-base (read-line)))
(fresh-line)
##########################################
[error]
[case文は数値やシンボルのマッチングに使用されますが、
 文字列のマッチングには対応していません。]

(princ (case (read)
         ("A" "T")
         ("T" "A")
         ("C" "G")
         ("G" "C")))
(fresh-line)

##########################################
[python]
b=str(input())
if b=='A':
    ans='T'
elif b=='T':
    ans='A'
elif b=='C':
    ans='G'
elif b=='G':
    ans='C'
print(ans)
##########################################
